export const egyptianGovernorates = [
  { value: "", label: "جميع المحافظات" },
  { value: "القاهرة", label: "القاهرة" },
  { value: "الجيزة", label: "الجيزة" },
  { value: "الدقهلية", label: "الدقهلية" },
];

export const governorateCities: { [key: string]: string[] } = {
  "القاهرة": ["القاهرة", "حلوان", "مدينتي", "الشروق", "العبور", "بدر", "التجمع"],
  "الجيزة": ["الجيزة", "6 أكتوبر", "الشيخ زايد", "العياط", "البدرشين", "الحوامدية"],
  "الدقهلية": ["الدقهلية", "المنصورة", "طلخا", "ميت غمر", "دكرنس", "منية النصر", "الجمالية", "شربين", "بلقاس", "السنبلاوين"]
};